Revit 2024 API
RevisionNumberingSequence.HasValidNumericRevisionSettings Method
 Checks whether the revision numbering sequence owns a valid numeric revision settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool HasValidNumericRevisionSettings()
Visual Basic
Public Function HasValidNumericRevisionSettings As Boolean
Visual C++
public:
bool HasValidNumericRevisionSettings()
Return Value
 True if the revision numbering sequence owns a valid numeric revision settings.
See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace